niklasdathe/IRBicycleWheelSpeedSensor/firmware/sdkconfig.defaults
# Target / board
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# RMT capture
CONFIG_RMT_RX_ISR_CACHE_SAFE=n

# C++ runtime features are not used by the firmware
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n

# Bluetooth CSC sensor: BLE-only NimBLE peripheral/GATT server
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_GATT_CLIENT=n
CONFIG_BT_NIMBLE_GATT_SERVER=y

# Bench-debug defaults. Fine-grained event switches live in the
# ir_spoke_debug component Kconfig and remain editable through menuconfig.
CONFIG_IR_SPOKE_DEBUG_ENABLE=y
CONFIG_IR_SPOKE_DEBUG_SERIAL=y
CONFIG_IR_SPOKE_DEBUG_LED=y
